REGULAR/Dmesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       39600;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       39700;
    }
    bottom
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          150;
        startFace       39900;
    }
    top
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          150;
        startFace       40050;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       40200;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          40000;
        startFace       40400;
    }
)

// ************************************************************************* //
